<template>
	<view class="text-left" style="height: 100%;overflow: hidden;">
		<mescroll-uni ref="mescrollRef" :fixed="false" :down="downOption" :up="upOption" @init="mescrollInit"
			@down="downCallback" @up="upCallback">
			盛世富购电商平台用户告知书
			<br />感谢使用盛世富购电商平台（下称平台），该平台是成都盛世泓达科技有限公司自主创立的电商平台，请审慎阅读以下内容并选择是否使用用户协议(以下简称“协议”)，务必重视协议中加粗的条款。若对该等条款有任何疑问或宝贵意见和建议，请及时联系盛世富购电商平台服务热线电话。
			<br />一、定义与释义
			<br />1、盛世富购电商平台是为用户提供现货销售、线上采购、金融协同等服务的网络平台(以下简称“平台”)，包括但不限于盛世富购APP、盛世富购微信小程序以及盛世富购网页端。
			<br />2、平台服务:盛世富购电商平台基于互联网，已包括盛世富购APP、盛世富购微信小程序等在内的各种形态向您提供的各项服务。
			<br />3、平台规则:包括在盛世富购平台已经发布以及后续发布的全部协议、规则、须知、解读、公告等内容。
			<br />4、平台用户:指在盛世富购电商平台合法注册，接受并认可平台规则的自然人、法人或其他组织，简称“用户”。
			<br />二、协议及服务确认
			<br />1、如用户非完全民事行为能力人，请告知用户监护人，并在其监护人指导下阅读本协议并决定是否接受本协议。若用户是未满18周岁的未成年人，在向平台提交个人信息前，请务必征得其父母/监护人同意并认真阅读本协议。
			<br />2、为了保证服务的及时性、准确性，请用户务必确认其提供信息的完整性、真实性、有效性，平台会进行实名制验证。一旦发现用户信息违反法律规定或者不符合业务规则的，平台可能会依法采取相应的措施，包括但不限终止或注销您的账户，或者暂停为其提供服务。
			<br />3、注册时点选接受“平台服务协议”或以任何方式进入盛世富购电商平台并使用服务即表示用户已充分阅读、理解并同意接受协议的条款并承诺按照条款的约定及平台的程序设置等享受权利、履行义务。
			<br />4、盛世富购电商平台有权根据国家法律法规变化及平台运营需要酌情修订“条款”，并以公告的形式进行更新，不再单独通知用户，经修订的“条款”一经在网站公布，即产生效力，构成协议各方权利义务的补充，并成为协议的一部分，并视为用户同意已同意新修订的条款。如用户不同意相关修订，请立即停止使用“服务”并于“条款”修改公布之日起7日内以书面形式及时与平台沟通。
			<br />三、账户管理
			<br />1、当用户按照注册页面提示填写信息、阅读并同意协议且完成会员注册程序后，才能成为平台的会员。会员注册的账户仅限于本人使用，不可转让、租借、赠与或继承。
			<br />2、用户确认其所填写/提供的注册资料是真实、准确、完整、合法有效的，且保证平台可以通过该等信息与其本人进行联系。如用户的注册信息有变更，请及时予以更新。如用户提供的注册资料不合法、不真实、不准确、不详尽，因此而引起的责任、其后果将全部由用户自己承担。
			<br />3、用户使用第三方账户快捷注册/绑定的，视为已授权平台使用与该账户有关的必要信息(例如账户名称、头像、验证码等)，同时需遵守第三方用户协议。
			<br />4、用户的账户注册/绑定成功后，将由用户自行设置名称、收货地址、手机号码和管理密码、验证码等账户信息。用户可以根据平台的业务规则改变密码。用户应谨慎合理的保存、使用自己的账户、密码或验证码，并对利用其的账户、密码或验证码完成管理权限验证而实施的所有行为、活动及事件负责。
			<br />5、用户理解并同意，平台向用户注册时预留的地址、电话、邮箱等任一方式发送信息，或者发送站内信息，即视为平台履行了送达、通知义务。
			<br />6、用户有权向平台要求注销自己的在册账户，经平台审核同意的,平台将对账户进行注销,用户与平台即终止合作关系。用户的账户被注销后，平台将无法为其提供数据、信息等查阅服务。
			<br />7、用户理解并承诺，用户所设置的帐号不得违反国家法律法规及“盛世富购”的相关规则，用户的帐号名称、头像和简介等注册信息及其他个人信息中不得出现违法和不良信息，未经他人许可不得用他人名义(包括但不限于冒用他人姓名、名称、字号、头像等或采取其他足以让人引起混淆的方式)开设帐号，不得恶意注册“盛世富购”帐号(包括但不限于频繁注册、批量注册帐号等行为)。用户在帐号注册及使用过程中需遵守相关法律法规，不得实施任何侵害国家利益、损害其他公民合法权益，有害社会道德风尚的行为。平台有权对用户提交的注册信息进行审核和监督管控。
			<br />8、用户在“盛世富购”中的注册帐号仅限于本人使用，未经平台书面同意，禁止以任何形式赠与、借用、出租、转让、售卖或以其他方式许可他人使用该帐号。如果平台发现或者有合理理由认为使用者并非帐号初始注册人，为保障帐号安全，平台有权立即暂停或终止向该注册帐号提供服务，并有权封存禁用该帐号。
			<br />9、用户有责任维护个人帐号、密码的安全性与保密性，并对用户已注册帐号所从事的活动承担全部法律责任，包括但不限于用户在“盛世富购”软件及相关服务上进行的任何数据修改、言论发表、款项支付等操作行为可能引起的一切法律责任。用户应高度重视对帐号与密码的安全及保密，在任何情况下不向他人透露帐号及密码。若发现他人未经许可使用自己的帐号或发生其他任何安全漏洞问题时，应当立即通知平台，做出应急处理。
			<br />10、如用户丢失帐号或遗忘密码，可遵照平台的电话及多种途径及时申请找回帐号或密码。用户理解并认可，密码找回机制仅需要识别申诉单上所填资料与系统记录资料具有一致性，而无法识别申诉人是否系帐号真正有权使用者。平台特别提醒用户应妥善保管自己的帐号和密码。当自己使用完毕后，应安全退出。因用户保管不当等自身原因或其他不可抗因素导致遭受盗号或密码丢失，应自行承担相应责任。
			<br />四、订单管理
			<br />1、用户根据协议或平台规则，通过点击、确认或类似方式签署的电子协议、订单，即视为用户本人真实意愿并具有法律效力。
			<br />2、若用户未能及时处理订单，或未能提交相关电请，可能会导致相关订单被取消或自己的信誉降低，因此引起的责任由用户自己承担。
			<br />五、用户的行为规范与承诺
			<br />1、在使用服务平台过程中，用户承诺遵守以下约定:
			<br />(1)在使用平台的服务过程中实施的所有行为均遵守国家法律、法规、政策及平台的活动规则，不违背社会公共利益或伦理道德，不损害他人的合法权益。
			<br />(2)不发布法律、法规、政策及行业规则禁止发布的信息，不发布涉嫌侵犯他人知识产权或其他合法权益的信息。
			<br />(3)不适用任何装置、软件或程序干预或试图干预平台的正常运行。
			<br />(4)不得进行危害网络安全的行为，包括但不限于:使用未经许可的数据或进入未经许可的账户;未经允许进入网络或者系统并获取、删除、修改增加数据;非法提供、获取他人的个人信息:恶意干扰平台的正常运行。
			<br />(5)不得发布任何有损平台的言论。
			<br />2、违反上述承诺时，您理解并同意:
			<br />(1)根据相关法律、政策或者平台规则，平台将采取相应措施，包括但不限于取消订单、撤回货品、或者直接终止/限制用户使用平台、限制用户参加活动、终止/注销用户的账户等措施。
			<br />(2)对干用户涉嫌违反承诺的行为对任意第三方造成损害的，用户均应当以自己的名义独立承担所有的法律责任，若因此使平台遭受任何损失，或受到任何第三方的索赔，及受到任何行政管理部门的处罚，用户应当赔偿平台因此造成的损失及发生的合理费用，包括但不限于律师费、调查费、公证费、差旅费等。
			<br />3、用户制作、评论、发布、传播的信息(包括但不限于随拍或上传至“盛世富购”平台的未公开的私密视频)应自觉遵守法律法规，否则平台有权立即采取相应处理措施。用户同意并承诺不制作、复制、发布、传播下列信息:
			<br />(1)反对宪法确定的基本原则的:
			<br />(2)危害国家安全，泄露国家秘密的:
			<br />(3)颠覆国家政权 推翻社会主义制度 煽动 分裂国家，破坏国家统一的;
			<br />(4)损害国家荣誉和利益的;
			<br />(5)宣扬恐怖主义、极端主义的;
			<br />(6)宣扬民族仇恨、民族歧视，破坏民族团结的;
			<br />(7)煽动地域歧视、地域仇恨的;
			<br />(8)破坏国家宗教政策，宣扬邪教和封建迷信的;
			<br />(9)编造、散布谣言、虚假信息，扰乱经济秩序和社会秩序、破坏社会稳定的;
			<br />(10)危害网络安全、利用网络从事危害国家安全、荣誉和利益的;
			<br />(11)侮辱或者诽谤他人，侵害他人合法权益的;
			<br />六、平台服务和地位
			<br />1、通过平台(含平台合作方)提供的服务用户可在平台网站上发布交易信息、查询商品和服务信息、达成交易意向并进行交易、参加平台组织的活动以及使用其它信息服务及技术服务。同时，为了给用户提供更加贴心和个性化的服务，平台将会向用户所填写的电话号码发送系统消息、交易信息、网站内容推送、资金变化等内容，并用于拨打或者接听语音通话.用户对本服务条款的认可，表示用户同意接收上述信息.如用户不同意接收上述信息的可发送
			<br />TD退订网站推送短信，也可拨打客服电话退订。平台还可能通过使用用户信息分析用户可能感兴趣的信息并向其提供:或通过系统向用户展示个性化的第三方推广信息:与合作伙伴及其他会员共享信息,帮助用户获得最便捷的交易体验。
			<br />2、平台网站仅作为用户选择交易对象，就货物和服务的交易进行协商，以及获取各类与贸易相关的服务的地点。同时，平台不承担会员间因交易而产生的法律关系及法律纠纷。请注意,平台不能控制或保证交易所涉及物品的质量、安全或合法性，以及相关交易各方履行在贸易协议项下的各项义务的能力。平台不能也不会控制交易各方能否履行协议义务。此外，用户应注意到，与以欺诈手段行事的相对方进行交易的风险是客观存在的。平台提醒用户在使用平台APP(含合作方及网商银行)服务时小心谨慎并运用常识判断是否存在欺诈行为。
			<br />3、平台与网商银行或其他合作方为合作关系，网商银行、其他合作方为平台合作方。网商银行为平台会员提供线上支付、结算等资金账户管理服务.会员将在线上与网商银行另行签署协议约定相关的权利义务。如用户使用其他平台合作方的相关服务，用户将根据合作方的要求与其签署协议约定相关的权利与义务，上述服务出现问题，平台会员应及时联络平台及平台合作方，平台将协助会员与平台合作方进行沟通协调。
			<br />七、除外责任
			<br />1、用户明确理解和同意,平台不对因下述任一情况而发生的任何损害赔偿承担责任包括但不限于利润、商誉、使用、数据等方面的损失或其他无形损失的损害赔偿(无论平台是否已被告知该等损害赔偿的可能性):
			<br />(1)使用或未能使用“服务”
			<br />(2)因通过成从“服务”购买或获取任何货物样品、数据、资料或服务,或通过成从“服务”接收任何信息或缔结任何交易所产生的获取替代货物和服务的费用;
			<br />(3)未经批准接入或更改用户的传输资料或数据任何第三者对“服务”的声明或关于“服务”的行为;
			<br />(4)因任何原因而引起的与“服务”有关的任何其他事宜。
			<br />2、平台会尽一切努力使用户在使用平台网站的过程中得到更好的体验感。但平台不能随时预见任何技术上的问题或其他困难，技术上的问题、困难可能会导致数据损失或其他服务中断，为此用户需明确理解和同意，用户使用“服务”的风险由用户自行承担。且“服务”以“按现状”和“按可得到”的状态提供。
			<br />平台明确声明不作任何种类的明示或暗示的保证包括但不限于关于适销性、适用于某一特定用途和无侵权行为等方面的保证。
			<br />3、平台相关内容可能涉及或链接到由第三方所控制或者运营的第三方网站或软件程序，平台不能也没有义务保证第三方网站或软件上的信息的真实性和有效性。第三方网站或软件或因不可抗力等其它无法控制的原因使平台系统崩溃或无法正常使用导致用户无法完成相关操作或丢失有关的信息、记录等，平台尽力协助处理善后事宜。但因此给用户造成的损失将由用户自行承担，平台不予承担。
			<br />4、因下列情形之一，导致平台无法正确执行用户提交的操作指令，平台不承担任何责任:(1)指令信息不明，存在乱码或不完整等:(2)不可抗力或意外事件:(3)其它平台无过失的情况。
			<br />5、平台可提供其他第三方网站或资源的链接。由于平台无法控制该等网站和资源，用户认可并同意平台并不对该等网站或资源的可用性负责，且不认可该等网站或资源上或可从该等网站或资源获取的任何内容、宣传、产品、服务或其他材料也不对该等网站或资源上或可从该等网站或资源获取的任何内容、宣传、产品、服务或其他材料等负责或承担任何责任。用户进一步认可和同意对于任何因使用或信赖从此类网站或资源上获取的此类内容、宣传、产品、服务或其他材料而造成(或声称造成)的任何直接或间接损失，平台均不承担责任。
			<br />八、法律适用与管辖
			<br />1、本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国法律，如无相关法律规定的,则应参照通用的商业惯例和(或)行业惯例。
			<br />2、本协议中的部分条款无效，不影响其他条款的效力。
			<br />3、用户认可平台发布的《平台总则》《交易细则》《隐私声明》《知识产权声明》《免责声明》属于协议的一部分:认可平台将来可能发布的各类规则、细则、协议等各类文本属于本协议的一部分。所有平台已经发布或将来可能发布的各类规则、细则、协议等文本均为本协议不可分割的一部分,与协议正文具有同等法律效力。
			<br />4、用户同意平台因经营业务需要有权将协议项下的权力义务就部分或全部进行转让，而无须再通知予用户并取得其同意。
		</mescroll-uni>


	</view>
</template>

<script>
	export default {
		name: "user-agreement",
		data() {
			return {
				mescroll: null,
				upOption: {
					use: false, //是否启用上拉加载
					onScroll: false, //监听滚动事件
					textNoMore: '暂无更多数据', //没有更多数据的提示文本
					auto: false, //是否在初始化完毕之后自动执行一次上拉加载的回调
					noMoreSize: 5, //数量要大于5条才显示无更多数据
					page: {
						num: 0,
						size: 10 // 每页数据的数量,默认10
					},
					empty: { //列表第一页无任何数据时,显示的空布局
						use: false //是否启用
					},
					textLoading: '加载中...', //上拉加载中的文本
					toTop: { //回到顶部按钮的配置
						safearea: true,
						bottom: "15%"
					}
				},
				downOption: {
					use: false, //是否启用下拉刷新
					auto: false, //是否在初始化完毕之后自动执行一次下拉刷新的回调 
				},
			};
		},
		methods: {
			mescrollInit(mescroll) {
				this.mescroll = mescroll;
				// mescroll.triggerUpScroll()
			},
			scrollFn(mescroll) {

			},
			downCallback() {

			},
			upCallback(mescroll) { //上拉加载

			},
		}
	}
</script>

<style>

</style>
